Qwen2ForCausalLM(
  (model): Qwen2Model(
    (embed_tokens): Embedding(152064, 8192)
    (layers): ModuleList(
      (0-79): 80 x Qwen2DecoderLayer(
        (self_attn): Qwen2SdpaAttention(
          (q_proj): Linear(in_features=8192, out_features=8192, bias=True)
          (k_proj): Linear(in_features=8192, out_features=1024, bias=True)
          (v_proj): Linear(in_features=8192, out_features=1024, bias=True)
          (o_proj): Linear(in_features=8192, out_features=8192, bias=False)
          (rotary_emb): Qwen2RotaryEmbedding()
        )
        (mlp): Qwen2MLP(
          (gate_proj): Linear(in_features=8192, out_features=29568, bias=False)
          (up_proj): Linear(in_features=8192, out_features=29568, bias=False)
          (down_proj): Linear(in_features=29568, out_features=8192, bias=False)
          (act_fn): SiLU()
        )
        (input_layernorm): Qwen2RMSNorm((8192,), eps=1e-06)
        (post_attention_layernorm): Qwen2RMSNorm((8192,), eps=1e-06)
      )
    )
    (norm): Qwen2RMSNorm((8192,), eps=1e-06)
    (rotary_emb): Qwen2RotaryEmbedding()
  )
  (lm_head): Linear(in_features=8192, out_features=152064, bias=False)
)
